/* Kernel driver for Communication Controller FA sniffer.
 *
 * Copyright (C) 2010  Michael Abbott, Diamond Light Source Ltd.
 *
 * The FA sniffer card captures a stream of Fast Acquisition frames from the
 * FA network and writes them to memory using PCIe DMA transfer.
 * A new frame arrives every 100 microseconds, and the sniffer has no control
 * over this data stream.
 *
 * The driver here endeavours to capture every frame arriving after a file
 * open call on the FA sniffer device. */

#include <linux/module.h>
#include <linux/version.h>
#include <linux/device.h>
#include <linux/fs.h>
#include <linux/cdev.h>
#include <linux/pci.h>
#include <linux/uaccess.h>
#include <linux/interrupt.h>
#include <linux/sched.h>

#include "fa_sniffer.h"

#define _S(x)   #x
#define S(x)    _S(x)

MODULE_AUTHOR("Michael Abbott, Diamond Light Source Ltd.");
MODULE_DESCRIPTION("Driver for PCIe Fast Acquisition Sniffer");
MODULE_LICENSE("GPL");
MODULE_VERSION(S(VERSION));

/* Module parameters. */
#define MIN_FA_BUFFER_COUNT     3
static int fa_block_shift = 19;     // Size of FA block buffer as power of 2
static int fa_buffer_count = 5;     // Number of FA block buffers

module_param(fa_block_shift,  int, S_IRUGO);
module_param(fa_buffer_count, int, S_IRUGO);



/* If test is true then do on_error, print message and goto target. */
#define TEST_(test, on_error, target, message) \
    do if (test) { \
        on_error; \
        printk(KERN_ERR "fa_sniffer: " message "\n"); \
        goto target; \
    } while (0)

/* If rc is an error code (< 0) then print message and goto target. */
#define TEST_RC(rc, target, message) \
    TEST_((rc) < 0, , target, message)

/* If ptr indicates an error then assign the associated error code to rc, print
 * message and goto target.  If ptr is in fact NULL we return -ENOMEM. */
#define TEST_PTR(rc, ptr, target, message) \
    TEST_(IS_ERR(ptr), rc = PTR_ERR(ptr)?:-ENOMEM, target, message)





/*****************************************************************************/
/*                      FA Sniffer Hardware Definitions                      */
/*****************************************************************************/


/* Xilinx vendor id: currently just a Xilinx development card. */
#define XILINX_VID      0x10EE
#define XILINX_DID      0x0007


/* Register map for FA sniffer PCIe interface. */
struct x5pcie_dma_registers {
    u32 dcsr;         /* 0x00 device control status register*/
    u32 ddmacr;       /* 0x04 device DMA control status register */
    u32 wdmatlpa;     /* 0x08 write DMA TLP address */
    u32 wdmatlps;     /* 0x0C write DMA TLP Size */
    u32 wdmatlpc;     /* 0x10 write DMA TLP count */
    u32 wdmatlpp;     /* 0x14 write DMA pattern */
    u32 rdmatlpp;     /* 0x18 read DMA expected pattern */
    u32 rdmatlpa;     /* 0x1C read DMA TLP address*/
    u32 rdmatlps;     /* 0x20 read DMA TLP size*/
    u32 rdmatlpc;     /* 0x24 read DMA TLP count*/
    u32 wdmaperf;     /* 0x28 write DMA performace*/
    u32 rdmaperf;     /* 0x2C read DMA performace*/
    u32 rdmastat;     /* 0x30 read DMA status*/
    u32 nrdcomp;      /* 0x34 Number of Read Completion*/
    u32 rcompdsizw;   /* 0x38 Read Completion Data Size */
    u32 dlwstat;      /* 0x3C Device Link Width Status*/
    u32 dltrsstat;    /* 0x40 Device Link Transaction Size Status */
    u32 dmisccont;    /* 0x44 Device Miscellaneous Control */
    u32 ccfaiirqclr;  /* 0x48 CC FAI interrupt clear register */
    u32 dummy[13];    /* 0x4C-0x7F Reserved Address Space */
    u32 ccfaicfgval;  /* Ox80 CC FAI configuration register */
    u32 wdmastatus;   /* 0x84 WDMA status register */
    u32 linkstatus;   /* 0x88 Link status register */
    u32 frameerrcnt;  /* 0x8C Frame error count */
    u32 softerrcnt;   /* 0x90 Soft error count */
    u32 harderrcnt;   /* 0x94 Hard error count */
};

struct fa_sniffer_hw {
    struct x5pcie_dma_registers *regs;
    int tlp_size;   // Max length of single PCI DMA transfer (in bytes)
};

#define BAR0_LEN    1024


static int code2size(int bCode)
{
    bCode = bCode & 0x7;
    if (bCode > 0x05)
        return 0;
    else
        return 128 << bCode;
}

static int DMAGetMaxPacketSize(struct x5pcie_dma_registers *regs)
{
    /* Read encoded max payload sizes */
    int dltrsstat = regs->dltrsstat;
    /* Convert encoded max payload sizes into byte count */
    /* bits [2:0] : Capability maximum payload size for the device */
    int wMaxCapPayload = code2size(dltrsstat);
    /* bits [10:8] : Programmed maximum payload size for the device */
    int wMaxProgPayload = code2size(dltrsstat >> 8);

    return wMaxCapPayload < wMaxProgPayload ?
        wMaxCapPayload : wMaxProgPayload;
}

/* Returns the requested block of bar registers. */
