/* Kernel driver for Communication Controller FA sniffer.
 *
 * Copyright (C) 2010-2012  Michael Abbott, Diamond Light Source Ltd.
 *
 * The FA sniffer driver is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or (at your
 * option) any later version.
 *
 * The FA sniffer driver is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General
 * Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, write to the Free Software Foundation, Inc., 51
 * Franklin St, Fifth Floor, Boston, MA 02110-1301 USA
 *
 * Contact:
 *      Dr. Michael Abbott,
 *      Diamond Light Source Ltd,
 *      Diamond House,
 *      Chilton,
 *      Didcot,
 *      Oxfordshire,
 *      OX11 0DE
 *      michael.abbott@diamond.ac.uk
 *
 * The FA sniffer card captures a stream of Fast Acquisition frames from the
 * FA network and writes them to memory using PCIe DMA transfer.
 * A new frame arrives every 100 microseconds, and the sniffer has no control
 * over this data stream.
 *
 * The driver here endeavours to capture every frame arriving after a file
 * open call on the FA sniffer device. */

#include <linux/module.h>
#include <linux/version.h>

#include <linux/delay.h>

#include "fa_sniffer.h"

#define _S(x)   #x
#define S(x)    _S(x)

MODULE_AUTHOR("Michael Abbott, Diamond Light Source Ltd.");
MODULE_DESCRIPTION("Driver for PCIe Fast Acquisition Sniffer");
MODULE_LICENSE("GPL");
MODULE_VERSION(S(VERSION));

/* Module parameters. */
#define MIN_FA_BUFFER_COUNT     3
static int fa_block_shift = 19;     // Size of FA block buffer as power of 2
static int fa_buffer_count = 5;     // Number of FA block buffers
static int fa_entry_count = 256;    // Default transfer size

module_param(fa_block_shift,  int, S_IRUGO);
module_param(fa_buffer_count, int, S_IRUGO);
module_param(fa_entry_count, int, S_IRUGO);


/* If test is true then do on_error, print message and goto target. */
#define TEST_(test, on_error, target, message) \
    do if (test) { \
        on_error; \
        printk(KERN_ERR "fa_sniffer: " message "\n"); \
        goto target; \
    } while (0)

/* If rc is an error code (< 0) then print message and goto target. */
#define TEST_RC(rc, target, message) \
    TEST_((rc) < 0, , target, message)

/* If ptr indicates an error then assign the associated error code to rc, print
 * message and goto target.  If ptr is in fact NULL we return -ENOMEM. */
#define TEST_PTR(rc, ptr, target, message) \
    TEST_(IS_ERR_OR_NULL(ptr), rc = PTR_ERR(ptr)?:-ENOMEM, target, message)



/* We specify the size of a single FA block as a power of 2 (because we're
 * going to allocate the block with __get_free_page(). */
#define FA_BLOCK_SIZE       (1 << fa_block_shift)




/*****************************************************************************/
/*                      FA Sniffer Hardware Definitions                      */
/*****************************************************************************/


/* Xilinx vendor id: currently just a Xilinx development card. */
#define XILINX_VID      0x10EE
#define XILINX_DID      0x0007
/* CERN SPEC board. */
#define SPEC_VID        0x10DC
#define SPEC_DID        0x018D


/* CERN SPEC Bar 4 definitions. */
#define GN4124_BAR              0x4
#define R_CLK_CSR               0x808
#define R_INT_CFG0              0x820
#define R_GPIO_DIR_MODE         0xA04
#define R_GPIO_INT_MASK_CLR     0xA18
#define R_GPIO_INT_MASK_SET     0xA1C
#define R_GPIO_INT_STATUS       0xA20
#define R_GPIO_INT_VALUE        0xA28
#define CLK_CSR_DIVOT_MASK      0x3F0
#define INT_CFG0_GPIO           15
#define GPIO_INT_SRC            8

/* CERN SPEC Bar 0 definitions. */
#define LCLK_LOCKED             0x10000
#define CLK_READ_SELECT         0x10004
#define CLK_READ_VAL            0x10008

/* Target clock frequency. */
#define MIN_CC_CLK_TICKS        8700
#define MAX_CC_CLK_TICKS        8706


/* For the development board we only need a small BAR0, but for the SPEC board
 * we have entries at high addresses so need a large BAR. */
#define BAR0_LEN_XILINX         4096
#define BAR0_LEN_SPEC           0x20000
#define BAR4_LEN                4096



/* Register map for FA sniffer PCIe interface. */
struct x5pcie_dma_registers {
    u32 dcsr;         /* 0x00 device control status register*/
    u32 ddmacr;       /* 0x04 device DMA control status register */
    u32 wdmatlpa;     /* 0x08 write DMA TLP address */
    u32 wdmatlps;     /* 0x0C write DMA TLP Size */
    u32 wdmatlpc;     /* 0x10 write DMA TLP count */
    u32 wdmatlpp;     /* 0x14 write DMA pattern */
    u32 rdmatlpp;     /* 0x18 read DMA expected pattern */
    u32 rdmatlpa;     /* 0x1C read DMA TLP address*/
    u32 rdmatlps;     /* 0x20 read DMA TLP size*/
    u32 rdmatlpc;     /* 0x24 read DMA TLP count*/
    u32 wdmaperf;     /* 0x28 write DMA performace*/
    u32 rdmaperf;     /* 0x2C read DMA performace*/
    u32 rdmastat;     /* 0x30 read DMA status*/
    u32 nrdcomp;      /* 0x34 Number of Read Completion*/
    u32 rcompdsizw;   /* 0x38 Read Completion Data Size */
    u32 dlwstat;      /* 0x3C Device Link Width Status*/
    u32 dltrsstat;    /* 0x40 Device Link Transaction Size Status */
    u32 dmisccont;    /* 0x44 Device Miscellaneous Control */
    u32 ccfaiirqclr;  /* 0x48 CC FAI interrupt clear register */
    u32 dummy[13];    /* 0x4C-0x7F Reserved Address Space */
    u32 ccfaicfgval;  /* Ox80 CC FAI configuration register */
    u32 wdmastatus;   /* 0x84 WDMA status register */
    u32 linkstatus;   /* 0x88 Link status register */
    u32 frameerrcnt;  /* 0x8C Frame error count */
    u32 softerrcnt;   /* 0x90 Soft error count */
    u32 harderrcnt;   /* 0x94 Hard error count */
};

struct fa_sniffer_hw {
    struct x5pcie_dma_registers __iomem *regs;
    void __iomem *bar4;     // Only present on CERN SPEC board
    int tlp_size;           // Max length of single PCI DMA transfer (in bytes)
};


static int code2size(int bCode)
{
    bCode = bCode & 0x7;
    if (bCode > 0x05)
        return 0;
    else
        return 128 << bCode;
}

static int DMAGetMaxPacketSize(struct x5pcie_dma_registers __iomem *regs)
{
    /* Read encoded max payload sizes */
    int dltrsstat = readl(&regs->dltrsstat);
    /* Convert encoded max payload sizes into byte count */
    /* bits [2:0] : Capability maximum payload size for the device */
    int wMaxCapPayload = code2size(dltrsstat);
    /* bits [10:8] : Programmed maximum payload size for the device */
    int wMaxProgPayload = code2size(dltrsstat >> 8);

    return wMaxCapPayload < wMaxProgPayload ?
        wMaxCapPayload : wMaxProgPayload;
}

